b_prediction/RANS_cases/4_pc_Re_tau_950/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.3.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0 1 0)
    (0 2 0)
    (0.1 0 0)
    (0.1 1 0)
    (0.1 2 0)
    (0 0 0.1)
    (0 1 0.1)
    (0 2 0.1)
    (0.1 0 0.1)
    (0.1 1 0.1)
    (0.1 2 0.1)
);

blocks
(
    hex (0 3 4 1 6 9 10 7) (2 320 2) simpleGrading (1 100 1)   
    hex (1 4 5 2 7 10 11 8) (2 320 2) simpleGrading (1 0.01 1)  
);

edges
(
);

boundary
(
    walls
    {
        type            wall;
        faces           
        (
        	(0 3 9 6)
        	(2 8 11 5)
        );
    }
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 6 7 1)
            (1 7 8 2)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (9 3 4 10)
            (10 4 5 11)
        );
    }
    sides
    {
        type            empty;
        faces           
        (
            (0 1 4 3)
            (1 2 5 4)
            (6 9 10 7)
            (7 10 11 8)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
